app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $userModel = new User();
        $researcherModel = new ResearcherModel();
        $statusModel = new StatusModel();
        $adviserModel = new AdviserModel();
        $grammarianModel = new GrammarianModel();
        $statisticianModel = new RemarkModel();
        $researchTeacherModel = new ResearchTeacherModel();

        $totalUsers = $userModel->countAll();

        $pendingStatus = $statusModel->where('name', 'Pending')->first();
        $pendingReviews = $pendingStatus ? $researcherModel->where('status_id', $pendingStatus['id'])->countAllResults() : 0;

        // Get counts for all roles
        $totalResearchTeachers = $researchTeacherModel->countAll();
        $totalGrammarians = $grammarianModel->countAll();
        $totalStatisticians = $statisticianModel->countAll();
        $totalAdvisers = $adviserModel->countAll();

        // Get total research count
        $totalResearch = $researcherModel->countAll();

        // Get approved and published (if statuses exist)
        $approvedStatus = $statusModel->where('name', 'Approved')->first();
        $totalApproved = $approvedStatus ? $researcherModel->where('status_id', $approvedStatus['id'])->countAllResults() : 0;

        $publishedStatus = $statusModel->where('name', 'Published')->first();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `statuses`
WHERE `name` = 'Pending'
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `research_teachers`
SELECT COUNT(*) AS `numrows` FROM `grammarians`
SELECT COUNT(*) AS `numrows` FROM `remarks`
SELECT COUNT(*) AS `numrows` FROM `advisers`
SELECT COUNT(*) AS `numrows` FROM `researchers`
SELECT *
FROM `statuses`
WHERE `name` = 'Approved'
 LIMIT 1
SELECT *
FROM `statuses`
WHERE `name` = 'Published'
 LIMIT 1