app/Controllers/Admin/Researchers.php

    public function index()
    {
        $categoryFilter = $this->request->getGet('category');
        $search = $this->request->getGet('search');

        $query = $this->researcherModel->select('researchers.*, users.username, users.email, research_categories.name as category_name')
                                     ->join('users', 'users.id = researchers.user_id')
                                     ->join('research_categories', 'research_categories.id = researchers.category_id', 'left');

        if ($categoryFilter) {
            $query->where('researchers.category_id', $categoryFilter);
        }

        if ($search) {
            $query->groupStart()
                  ->like('researchers.fullname', $search)
                  ->orLike('researchers.institutional_id', $search)
                  ->orLike('users.username', $search)
                  ->orLike('users.email', $search)
                  ->groupEnd();
        }

        $data = [
            'title' => 'Researchers Directory',
            'page_title' => 'Researchers List',
            'researchers' => $query->orderBy('researchers.created_at', 'DESC')->findAll(),
            'categories' => $this->categoryModel->findAll(),
---
SELECT `researchers`.*, `users`.`username`, `users`.`email`
FROM `researchers`
JOIN `users` ON `users`.`id` = `researchers`.`user_id`
SELECT `user_id`
FROM `researchers`
SELECT *
FROM `research_categories`

        ];

        if ($this->researcherModel->insert($data)) {
            return redirect()->to('admin/researchers')->with('success', 'Researcher profile created successfully.');
---
SELECT `researchers`.*, `users`.`username`, `users`.`email`, `research_categories`.`name` as `category_name`, `designations`.`name` as `designation_name`, `school_years`.`name` as `school_year_name`, `strands`.`name` as `strand_name`, `courses`.`name` as `course_name`, `advisers`.`name` as `adviser_name`, `grammarians`.`name` as `grammarian_name`, `remarks`.`name` as `remark_name`
FROM `researchers`
LEFT JOIN `users` ON `users`.`id` = `researchers`.`user_id`
LEFT JOIN `research_categories` ON `research_categories`.`id` = `researchers`.`category_id`
LEFT JOIN `designations` ON `designations`.`id` = `researchers`.`designation_id`
LEFT JOIN `school_years` ON `school_years`.`id` = `researchers`.`school_year_id`
LEFT JOIN `strands` ON `strands`.`id` = `researchers`.`strand_id`
LEFT JOIN `courses` ON `courses`.`id` = `researchers`.`course_id`
LEFT JOIN `advisers` ON `advisers`.`id` = `researchers`.`adviser_id`
LEFT JOIN `grammarians` ON `grammarians`.`id` = `researchers`.`grammarian_id`
LEFT JOIN `remarks` ON `remarks`.`id` = `researchers`.`remark_id`
ORDER BY `researchers`.`created_at` DESC

    public function highSchool()
    {
        $search = $this->request->getGet('search');
        $strand = $this->request->getGet('strand');

        $query = $this->researcherModel->select('researchers.*, users.username, users.email, research_categories.name as category_name')
                                     ->join('users', 'users.id = researchers.user_id')
                                     ->join('research_categories', 'research_categories.id = researchers.category_id', 'left')
                                     ->where('research_categories.name', 'High School Department');

        if ($strand && in_array($strand, ['HUMSS', 'STEM', 'ABM'], true)) {
            $query->where('researchers.strand_degree_program', $strand);
        }

        if ($search) {
            $query->groupStart()
                  ->like('researchers.fullname', $search)
                  ->orLike('researchers.institutional_id', $search)
                  ->orLike('users.username', $search)
                  ->orLike('users.email', $search)
                  ->groupEnd();
        }

        $pager = \Config\Services::pager();
        $researchers = $query->orderBy('researchers.created_at', 'DESC')->paginate(10, 'highSchool');

        $data = [
            'title' => 'High School Department',
            'page_title' => 'High School Department Researchers',
            'researchers' => $researchers,
            'pager' => $pager,
            'categories' => $this->categoryModel->findAll(),
            'search' => $search,
            'strand' => $strand
        ];
---
SELECT *
FROM `research_categories`