app/Controllers/Admin/Researchers.php


        $query->orderBy('researchers.created_at', 'DESC');

        $data = [
            'title' => 'Research Directory',
            'page_title' => 'Research List',
            'researchers' => $query->findAll(),
            'categories' => $this->categoryModel->findAll(),
            'schoolYears' => $this->schoolYearModel->findAll(),
            'advisers' => $this->adviserModel->findAll(),
            'grammarians' => $this->grammarianModel->findAll(),
            'statisticians' => $this->statisticianModel->findAll(),
            'researchTeachers' => $this->researchTeacherModel->findAll(),
            'strands' => $this->strandModel->findAll(),
            'selectedCategory' => $categoryFilter,
            'selectedSchoolYear' => $schoolYearFilter,
            'selectedStrand' => $strandFilter,
            'selectedAdviser' => $adviserFilter,
            'selectedGrammarian' => $grammarianFilter,
            'selectedStatistician' => $statisticianFilter,
            'selectedResearchTeacher' => $researchTeacherFilter,
            'search' => $search
        ];
---
SELECT *
FROM `strands`
SELECT *
FROM `research_teachers`
SELECT *
FROM `grammarians`
SELECT *
FROM `advisers`
SELECT *
FROM `school_years`

    public function create()
    {
        $data = [
            'title' => 'Add New Researcher',
            'page_title' => 'Create Researcher Profile',
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),
            'designations' => $this->designationModel->orderBy('name', 'ASC')->findAll(),
            'schoolYears' => $this->schoolYearModel->orderBy('name', 'ASC')->findAll(),
            'strands' => $this->strandModel->orderBy('name', 'ASC')->findAll(),
            'statuses' => $this->statusModel->orderBy('name', 'ASC')->findAll(),
            'advisers' => $this->adviserModel->orderBy('name', 'ASC')->findAll(),
            'grammarians' => $this->grammarianModel->orderBy('name', 'ASC')->findAll(),
            'statisticians' => $this->statisticianModel->orderBy('name', 'ASC')->findAll(),
            'researchTeachers' => $this->researchTeacherModel->orderBy('name', 'ASC')->findAll(),
            'abstracts' => $this->abstractModel->orderBy('name', 'ASC')->findAll(),
            'defenseStatuses' => $this->defenseStatusModel->orderBy('name', 'ASC')->findAll(),
        ];
---
SELECT *
FROM `grammarians`
ORDER BY `name` ASC
SELECT *
FROM `advisers`
ORDER BY `name` ASC
SELECT *
FROM `research_teachers`
ORDER BY `name` ASC
SELECT *
FROM `statuses`
ORDER BY `name` ASC
SELECT *
FROM `abstracts`
ORDER BY `name` ASC
SELECT *
FROM `defense_statuses`
ORDER BY `name` ASC

    public function edit($id)
    {
        $researcher = $this->researcherModel->select('researchers.*, users.username')
                                           ->join('users', 'users.id = researchers.user_id', 'left')
                                           ->find($id);

        if (!$researcher) {
            return redirect()->to('admin/researchers')->with('error', 'Researcher not found.');
        }

        $data = [
            'title' => 'Edit Researcher',
            'page_title' => 'Update Profile: ' . ($researcher['username'] ?? $researcher['fullname']),
            'researcher' => $researcher,
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),
            'designations' => $this->designationModel->orderBy('name', 'ASC')->findAll(),
            'schoolYears' => $this->schoolYearModel->orderBy('name', 'ASC')->findAll(),
            'strands' => $this->strandModel->orderBy('name', 'ASC')->findAll(),
            'statuses' => $this->statusModel->orderBy('name', 'ASC')->findAll(),
            'advisers' => $this->adviserModel->orderBy('name', 'ASC')->findAll(),
            'grammarians' => $this->grammarianModel->orderBy('name', 'ASC')->findAll(),
            'statisticians' => $this->statisticianModel->orderBy('name', 'ASC')->findAll(),
            'researchTeachers' => $this->researchTeacherModel->orderBy('name', 'ASC')->findAll(),
            'abstracts' => $this->abstractModel->orderBy('name', 'ASC')->findAll(),
            'defenseStatuses' => $this->defenseStatusModel->orderBy('name', 'ASC')->findAll(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `researchers`
JOIN `users` ON `users`.`id` = `researchers`.`user_id`
LEFT JOIN `research_categories` ON `research_categories`.`id` = `researchers`.`category_id`
WHERE `research_categories`.`name` = 'College Department'
SELECT `researchers`.*, `users`.`username`, `users`.`email`, `research_categories`.`name` as `category_name`
FROM `researchers`
JOIN `users` ON `users`.`id` = `researchers`.`user_id`
LEFT JOIN `research_categories` ON `research_categories`.`id` = `researchers`.`category_id`
WHERE `research_categories`.`name` = 'College Department'
ORDER BY `researchers`.`created_at` DESC

    public function update($id)
    {
        $researcher = $this->researcherModel->find($id);
---
SELECT *
FROM `researchers`
WHERE `researchers`.`id` = '19'

            'page_title' => 'Research by Research Teachers',
            'researchers' => $query->findAll(),
            'categories' => $this->categoryModel->findAll(),
            'schoolYears' => $this->schoolYearModel->findAll(),
            'advisers' => $this->adviserModel->findAll(),
            'grammarians' => $this->grammarianModel->findAll(),
            'statisticians' => $this->statisticianModel->findAll(),
            'researchTeachers' => $this->researchTeacherModel->findAll(),
            'strands' => $this->strandModel->findAll(),
---
SELECT *
FROM `school_years`
SELECT *
FROM `advisers`
SELECT *
FROM `grammarians`
SELECT *
FROM `research_teachers`
SELECT *
FROM `strands`