app/Controllers/Admin/Researchers.php

    public function index()
    {
        $categoryFilter = $this->request->getGet('category');
        $schoolYearFilter = $this->request->getGet('school_year');
        $strandFilter = $this->request->getGet('strand');
        $search = $this->request->getGet('search');
        $sort = $this->request->getGet('sort');

        $query = $this->researcherModel->select('researchers.*, users.username, users.email, research_categories.name as category_name, designations.name as designation_name, school_years.name as school_year_name, strands.name as strand_name, courses.name as course_name, advisers.name as adviser_name, grammarians.name as grammarian_name, remarks.name as remark_name')
                                     ->join('users', 'users.id = researchers.user_id', 'left')
                                     ->join('research_categories', 'research_categories.id = researchers.category_id', 'left')
                                     ->join('designations', 'designations.id = researchers.designation_id', 'left')
                                     ->join('school_years', 'school_years.id = researchers.school_year_id', 'left')
                                     ->join('strands', 'strands.id = researchers.strand_id', 'left')
                                     ->join('courses', 'courses.id = researchers.course_id', 'left')
                                     ->join('advisers', 'advisers.id = researchers.adviser_id', 'left')
                                     ->join('grammarians', 'grammarians.id = researchers.grammarian_id', 'left')
                                     ->join('remarks', 'remarks.id = researchers.remark_id', 'left');
---
SELECT `researchers`.*, `users`.`username`, `users`.`email`, `research_categories`.`name` as `category_name`
FROM `researchers`
JOIN `users` ON `users`.`id` = `researchers`.`user_id`
LEFT JOIN `research_categories` ON `research_categories`.`id` = `researchers`.`category_id`
ORDER BY `researchers`.`created_at` DESC

    public function create()
    {
        $data = [
            'title' => 'Add New Researcher',
            'page_title' => 'Create Researcher Profile',
            'categories' => $this->categoryModel->orderBy('name', 'ASC')->findAll(),
            'designations' => $this->designationModel->orderBy('name', 'ASC')->findAll(),
            'schoolYears' => $this->schoolYearModel->orderBy('name', 'ASC')->findAll(),
            'strands' => $this->strandModel->orderBy('name', 'ASC')->findAll(),
            'courses' => $this->courseModel->orderBy('name', 'ASC')->findAll(),
            'statuses' => $this->statusModel->orderBy('name', 'ASC')->findAll(),
            'advisers' => $this->adviserModel->orderBy('name', 'ASC')->findAll(),
            'grammarians' => $this->grammarianModel->orderBy('name', 'ASC')->findAll(),
            'remarks' => $this->remarkModel->orderBy('name', 'ASC')->findAll(),
            'abstracts' => $this->abstractModel->orderBy('name', 'ASC')->findAll(),
        ];
---
SELECT *
FROM `remarks`
ORDER BY `name` ASC

    public function college()
    {
        $search = $this->request->getGet('search');
        $strand = $this->request->getGet('strand');

        $query = $this->researcherModel->select('researchers.*, users.username, users.email, research_categories.name as category_name')
                                     ->join('users', 'users.id = researchers.user_id', 'left')
                                     ->join('research_categories', 'research_categories.id = researchers.category_id', 'left')
                                     ->where('research_categories.name', 'College Department');

        if ($strand && in_array($strand, ['HUMSS', 'STEM', 'ABM'], true)) {
            $query->where('researchers.strand_degree_program', $strand);
        }

        if ($search) {
            $query->groupStart()
                  ->like('researchers.fullname', $search)
                  ->orLike('users.username', $search)
                  ->orLike('users.email', $search)
                  ->groupEnd();
        }

        $pager = \Config\Services::pager();
        $researchers = $query->orderBy('researchers.created_at', 'DESC')->paginate(10, 'college');

        $data = [
            'title' => 'College Department',
            'page_title' => 'College Department Researchers',
            'researchers' => $researchers,
            'pager' => $pager,
            'categories' => $this->categoryModel->findAll(),
            'search' => $search,
            'strand' => $strand
        ];
---
SELECT *
FROM `research_categories`
SELECT `researchers`.*, `research_categories`.`name` as `category_name`, `statuses`.`name` as `status_name`
FROM `researchers`
LEFT JOIN `research_categories` ON `research_categories`.`id` = `researchers`.`category_id`
LEFT JOIN `statuses` ON `statuses`.`id` = `researchers`.`status_id`
ORDER BY `researchers`.`fullname` ASC

    public function updateStatus($id)
    {
        $researcher = $this->researcherModel->find($id);
        if (!$researcher) {
            return redirect()->to('admin/researchers')->with('error', 'Researcher not found.');
        }

        $status = $this->request->getPost('status');
        if (!in_array($status, ['active', 'inactive', 'on_leave', 'completed'])) {
            return redirect()->back()->with('error', 'Invalid status.');
        }

        if ($this->researcherModel->update($id, ['status' => $status])) {
            return redirect()->to('admin/researchers')->with('success', 'Status updated successfully.');
---
SELECT *
FROM `statuses`

    public function updateStatusPage()
    {
        $categoryFilter = $this->request->getGet('category');
        $search = $this->request->getGet('search');

        $query = $this->researcherModel->select('researchers.*, research_categories.name as category_name, statuses.name as status_name')
                                     ->join('research_categories', 'research_categories.id = researchers.category_id', 'left')
                                     ->join('statuses', 'statuses.id = researchers.status_id', 'left');

        if ($categoryFilter) {
            $query->where('researchers.category_id', $categoryFilter);
        }

        if ($search) {
            $query->groupStart()
                  ->like('researchers.fullname', $search)
                  ->orLike('researchers.approved_research_title', $search)
                  ->groupEnd();
        }

        $data = [
            'title' => 'Update Status',
            'page_title' => 'Update Researcher Status',
            'researchers' => $query->orderBy('researchers.fullname', 'ASC')->findAll(),
            'categories' => $this->categoryModel->findAll(),
            'statuses' => $this->statusModel->findAll(),
            'selectedCategory' => $categoryFilter,
            'search' => $search
        ];
---
SELECT `researchers`.*, `research_categories`.`name` as `category_name`, `statuses`.`name` as `status_name`
FROM `researchers`
LEFT JOIN `research_categories` ON `research_categories`.`id` = `researchers`.`category_id`
LEFT JOIN `statuses` ON `statuses`.`id` = `researchers`.`status_id`
ORDER BY `researchers`.`fullname` ASC
SELECT *
FROM `statuses`
SELECT *
FROM `research_categories`