app/Controllers/Admin/Users.php

    public function index()
    {
        $data['users'] = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function delete($id)
    {
        if ($this->userModel->delete($id)) {
---
DELETE FROM `users`
WHERE `id` IN ('6')