app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin1111@gmail.com'
 LIMIT 1
---
    public function doLogin()
    {
        $userModel = new User();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();