app/Models/AuditLogModel.php

INSERT INTO `audit_logs` (`user_id`, `action`, `entity_type`, `entity_id`, `details`, `ip_address`, `user_agent`, `created_at`) VALUES ('1', 'LOGIN', 'users', 1, '{\"status\":\"success\"}', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/147.0.0.0 Safari/537.36', '2026-04-26 10:52:57')
---
    public static function log(string $action, ?string $entityType = null, ?int $entityId = null, ?array $details = null)
    {
        $model = new self();
        $request = service('request');

        $data = [
            'user_id'     => session()->get('user_id'),
            'action'      => strtoupper($action),
            'entity_type' => $entityType,
            'entity_id'   => $entityId,
            'details'     => $details ? json_encode($details) : null,
            'ip_address'  => $request->getIPAddress(),
            'user_agent'  => $request->getUserAgent()->getAgentString()
        ];

        return $model->insert($data);

SELECT `audit_logs`.*, `users`.`username`
FROM `audit_logs`
LEFT JOIN `users` ON `users`.`id` = `audit_logs`.`user_id`
ORDER BY `audit_logs`.`created_at` DESC
---
    public function getLogsWithUsers()
    {
        return $this->select('audit_logs.*, users.username')
                    ->join('users', 'users.id = audit_logs.user_id', 'left')
                    ->orderBy('audit_logs.created_at', 'DESC')
                    ->findAll();